export type Term = "Първи срок" | "Втори срок";

export type SubjectGrades = {
  subject: string;
  gradesByTerm: Record<Term, number[]>;
};

export const gradesData: SubjectGrades[] = [
  { subject: "Български език и литература", gradesByTerm: { "Първи срок": [], "Втори срок": [6] } },
  { subject: "Немски език", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Математика", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Гражданско образование", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Физическо възпитание и спорт", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Чужд език по професията (ОбПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },

  { subject: "Бази данни – практика (ИУЧ – ОтПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Обектно-ориентирано програмиране – практика (ИУЧ – ОтПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Разработка на софтуер – практика (ИУЧ – ОтПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },

  { subject: "Бази данни – теория (ИУЧ – ОтПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Обектно-ориентирано програмиране – теория (ИУЧ – ОтПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Разработка на софтуер – теория (ИУЧ – ОтПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },

  { subject: "Конкурентно програмиране – практика (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Математически основи на програмирането – практика (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Операционни системи – практика (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Програмиране за вградени системи – практика (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [6], "Втори срок": [6] } },

  { subject: "Производствена практика (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },

  { subject: "Конкурентно програмиране – теория (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Математически основи на програмирането – теория (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Операционни системи – теория (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Програмиране за вградени системи – теория (ИУЧ – СПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },

  { subject: "Технология на софтуерната разработка (ИУЧ – РПП)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Спортни дейности (футбол)", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Безопасност на движението", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
  { subject: "Час на класа", gradesByTerm: { "Първи срок": [], "Втори срок": [] } },
];
